# Text_RPG/GeneratorsAndData/npcGenerator.py
import random

from Entities.npc import NPC

names = ["Орест",
         "Лада",
         "Борис",
         "Закарі",
         "Гідеон",
         "Алекс",
         "Алісія",
         "Ліліт",
         "Рудольф"]

roles = ["Мандрівник / Мандрівниця",
         "Торговець / Торговка",
         "Ремісник / Ремісниця",
         "Бард",
         "Алхімк",
         "Мечник / Мечниця",
         "Авантюрист / Авантюристка",
         "Дослідник / Дослідниця",
         "Слідопит / Слідопитка",
         "Кравець / Кравчиня"]

phrases = ["Останнім часом тут неспокійно...",
           "Ви чули що в цих краях бачили привидів?",
           "Здається... В мене лайно на підошві!",
           "Треба виконати завдання за будь яку ціну!",
           "Колись і мене вела дорога пригод. Але потім мені прострелили коліно.",
           "Безумний? Я був колись безумним! Вони запхали мене в кімнату... В м'яку \n"
                "кімнату... В м'яку кімнати зі щурами. Щури робили мене безумним!",
           "Якийсь тут дивний вітер... Моторошне місце.",
           "А правду говорять, що у гномів бородаті жінки?"]

def generate_npc():
    return NPC(
        random.choice(names),
        random.choice(roles),
        random.choice(phrases)
    )

def generate_npcs(count):
    npcs = []

    for _ in range(count):
        npcs.append(generate_npc())

    return npcs