import pygame
from settings import (
    CELL_SIZE,
    COLS,
    ROWS,
    SNAKE_COLOR,
    SNAKE_HEAD_COLOR 
)
 
class Snake: # Класс об'єкту змії
    def __init__(self): # Ініціалізація змії
        start_x = COLS // 2 # Початкова позиція змії по горизонталі (по центру екрану)
        start_y = ROWS // 2 # Початкова позиція змії по вертикалі (по центру екрану)

        self.body = [(start_x, start_y), # Початкове тіло змії (3 сегменти, включаючи голову)
                     (start_x - 1, start_y), # Перший сегмент тіла змії (один за головою)
                     (start_x - 2, start_y)] # Другий сегмент тіла змії (два за головою)
        
        self.direction = (1, 0) # Початковий напрямок руху змії (вправо)
        self.next_direction = (1, 0) # Наступний напрямок руху змії (вправо)
        self.shoud_grow = False # Прапор для визначення, чи повинна змія рости після наступного руху

    def head(self):
        # Метод для отримання позиції голови змії (першого сегмента тіла)
        return self.body[0]
    
    def change_direction(self, new_direction):
        # Обчислюємо протилежний напрямок до поточного напрямку змії
        opposite_direction = (-self.direction[0], -self.direction[1])
        # Перевіряємо, чи новий напрямок не є протилежним поточному напрямку змії
        if new_direction != opposite_direction:
            # Якщо новий напрямок не є протилежним поточному напрямку, оновлюємо наступний напрямок
            self.next_direction = new_direction

    def move(self):
        # Оновлюємо поточний напрямок змії на наступний напрямок, який був встановлений через метод change_direction
        self.direction = self.next_direction
        
        # Отримуємо поточну позицію голови змії
        head_x, head_y = self.head()
        # Обчислюємо нову позицію голови змії, додаючи крок руху (напрямок) до поточної позиції голови
        step_x, step_y = self.direction
        # Нова позиція голови змії після руху
        new_head = (head_x + step_x, head_y + step_y)

        # Вставляємо нову позицію голови змії на початок списку body, що представляє тіло змії
        self.body.insert(0, new_head)

        # Якщо прапор shoud_grow встановлений в True, це означає, що змія повинна рости після цього руху, тому ми не видаляємо останній сегмент тіла змії (не виконуємо self.body.pop()). Якщо прапор shoud_grow встановлений в False, це означає, що змія не повинна рости, тому ми видаляємо останній сегмент тіла змії (виконуємо self.body.pop()), щоб підтримувати довжину змії постійною.
        if self.shoud_grow:
            # Якщо змія повинна рости, ми не видаляємо останній сегмент тіла змії, що дозволяє змії збільшуватися в довжину на один сегмент після цього руху. Після того, як ми дозволили змії рости, ми скидаємо прапор shoud_grow назад в False, щоб наступного разу, коли змія рухатиметься, вона не буде рости, якщо знову не буде встановлено прапор shoud_grow в True.
            self.shoud_grow = False
        else:
            # Якщо змія не повинна рости, ми видаляємо останній сегмент тіла змії, що дозволяє змії підтримувати постійну довжину. Це означає, що змія рухається вперед, додаючи нову позицію голови і видаляючи останній сегмент тіла, що створює ефект руху змії по екрану.
            self.body.pop()

    def draw(self, screen):
        # Метод для відображення змії на екрані. Він приймає параметр screen, який є об'єктом поверхні Pygame, на якій буде намальована змія. Метод ітерується по кожному сегменту тіла змії (кожному елементу в списку body) і малює прямокутник для кожного сегмента. Колір прямокутника визначається залежно від того, чи є сегмент головою змії (перший сегмент) або тілом змії (інші сегменти). Голові змії присвоюється колір SNAKE_HEAD_COLOR, а тілу змії присвоюється колір SNAKE_COLOR. Прямокутники малюються з невеликим відступом (inflate(-4, -4)) і з закругленими кутами (border_radius=6) для більш приємного вигляду.
        for index, cell in enumerate(self.body):
            # Розпаковуємо координати x та y з кортежу cell, який представляє позицію сегмента змії на ігровому полі. Кожен сегмент змії має координати, які визначають його розташування на сітці ігрового поля. Ці координати використовуються для визначення позиції прямокутника, який буде намальований для цього сегмента змії на екрані.
            x, y = cell
            # Створюємо об'єкт Rect, який представляє прямокутник для цього сегмента змії. Параметри Rect визначають позицію та розмір прямокутника на екрані. Позиція визначається координатами x та y, помноженими на CELL_SIZE, щоб перетворити координати сітки в піксельні координати на екрані. Розмір прямокутника визначається CELL_SIZE для ширини та висоти, що відповідає розміру однієї клітинки на ігровому полі.
            rect = pygame.Rect(x * CELL_SIZE, # позиція по x
                               y * CELL_SIZE, # пзиція по y
                               CELL_SIZE, # розмір по x
                               CELL_SIZE) # розмір по y
            # Визначаємо колір для цього сегмента змії. Якщо індекс сегмента (index) дорівнює 0, це означає, що цей сегмент є головою змії, і ми присвоюємо йому колір SNAKE_HEAD_COLOR. Якщо індекс не дорівнює 0, це означає, що цей сегмент є тілом змії, і ми присвоюємо йому колір SNAKE_COLOR. Це дозволяє візуально відрізнити голову змії від її тіла на екрані.
            color = SNAKE_HEAD_COLOR if index == 0 else SNAKE_COLOR
            # Малюємо прямокутник для цього сегмента змії на екрані. Ми використовуємо метод pygame.draw.rect, який приймає параметри: поверхню screen, колір color, об'єкт Rect rect, який визначає позицію та розмір прямокутника, а також додаткові параметри для налаштування вигляду прямокутника. У цьому випадку ми використовуємо метод inflate(-4, -4) для зменшення розміру прямокутника на 4 пікселя з кожного боку, щоб створити відступ між сегментами змії. Ми також використовуємо параметр border_radius=6 для створення закруглених кутів у прямокутниках, що робить вигляд змії більш приємним і плавним.
            pygame.draw.rect(screen, color, rect.inflate(-4,-4), border_radius=6)

    def grow(self):
        # Вмикає ріст на наступному кросі при русі
        self.shoud_grow = True
    
    def hit_wall(self):
        # Розпаковка списку
        head_x, head_y = self.head()
        # Перевіряємо, чи не вилізли за межі сітки по всіх 4 сторонах
        return head_x < 0 or head_x >= COLS or head_y < 0 or head_y >= ROWS
    
    def hit_self(self):
        # Чи є голова у списку, окрім першого індексу, де вона точно є
        return self.head() in self.body[1:]